import chalk from 'chalk';
import readlineSync from 'readline-sync';
// 화면 띄어주기 위한 용도.
export function displayFristDice(dice) {
  console.clear();
  console.log(
    chalk.magentaBright(
      `\n========================= 주사위 를 던져주세요 ========================`,
    ),
  );
  console.log(
    chalk.cyanBright(`
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣴⣶⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣶⠿⠟⠛⠉⠁⠈⠙⠿⣶⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⡾⠟⠉⠀⠀⠀⣠⣤⣄⡀⠀⠀⠀⠉⠻⢷⣦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣶⠿⠛⠁⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠉⠛⠿⣦⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⡾⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⢿⣿⣿⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠻⣶⣄⡀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⣀⣤⣶⠟⠋⠁⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠙⠻⣶⣄⡀⠀⠀⠀
  ⠀⠀⣀⣤⣶⠿⠛⠉⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⣷⠄⠀⠀⠀⠀⠀⣠⣴⣶⣤⡀⠀⠀⠀⠀⠀⣾⣿⣿⣿⡆⠀⠀⠀⠀⠈⠙⠻⣶⣤⡀
  ⢰⡾⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⡿⠁⠀⠀⠀⠀⠐⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⢿⣿⣿⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀⣻⡇
  ⠘⣿⡀⠿⠷⣦⣤⣀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠀⠀⠀⠀⠀⠀⠀⠉⠛⠛⠃⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⢀⣠⣴⡾⠟⠂⢽⡇
  ⠀⢻⣇⠀⠀⠀⠉⠛⠿⣶⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⠟⠋⠁⠀⠀⠀⣺⡇
  ⠀⠘⣿⡀⠀⠀⠀⠀⠀⠀⠈⠙⠛⠿⢶⣦⣤⣀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⣀⣴⡾⠛⠉⠀⠀⠀⠀⠀⠀⠀⣺⡇
  ⠀⠀⢻⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⢷⣦⣄⡀⠀⠀⠸⣿⣿⡿⠏⠀⠀⢀⣤⣶⠿⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇
  ⠀⠀⠘⣿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠻⠷⣶⣄⡀⠀⠀⣀⣤⡾⠟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⣿⠆
  ⠀⠀⠀⢻⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢃⣄⠾⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⠀⣿⠁
  ⠀⠀⠀⠸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀⠀⢰⣾⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⢨⣿⠀
  ⠀⠀⠀⠀⢿⡇⠀⠀⠀⠀⠀⠀⠀⢠⣴⣦⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀⠀⠙⢿⣿⠿⠃⠀⠀⣴⣶⣦⡀⠀⠀⠀⠀⠀⢸⣏⠀
  ⠀⠀⠀⠀⢸⣷⠀⠀⠀⠀⠀⠀⢀⣿⣿⣿⣿⣷⡄⠀⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⡇⠀⠀⡀⡀⠀⢸⡗⠀
  ⠀⠀⠀⠀⠀⢿⡆⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠛⠋⠀⠀⣼⣿⣿⡆⢸⡯⠀
  ⠀⠀⠀⠀⠀⠘⣿⡀⠀⠀⠀⠀⠀⠀⠉⠋⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⠿⠟⠁⣸⡿⠀
  ⠀⠀⠀⠀⠀⠀⢻⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⡿⠋⠁⠀
  ⠀⠀⠀⠀⠀⠀⠈⢿⣶⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢺⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣾⠟⠉⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠻⢷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⠿⠋⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠻⢷⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢘⣿⠀⠀⠀⠀⠀⠀⠀⢀⣤⡾⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠻⢷⣤⣀⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀⠀⠀⠀⢀⣴⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠿⣶⣄⡀⠀⠀⢸⣿⠀⠀⢀⣠⣾⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠻⣶⣄⣸⣿⣠⣴⠿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠻⠿⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  `),
  );
  console.log(
    chalk.magentaBright(`| LUCK : ${dice._luck} `) +
      chalk.magentaBright(`| STR : ${dice._str} `) +
      chalk.magentaBright(`| DEX : ${dice._dex} `),
  );
  console.log(
    chalk.magentaBright(
      `====================================================================\n`,
    ),
  );
}
export function displayDefolt(player, day, dayName, dayStack, playerGold) {
  console.log(
    chalk.magentaBright(
      `\n===================== 여정을 선택해 주세요! ====================`,
    ),
  );
  console.log(
    chalk.cyanBright(`
        ⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠
        ⢻⡀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⢀⡟
        ⠘⢧⠀⠀⠀⠀⣰⠏⢷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡾⠹⣆⠀⠀⠀⢀⡼⠁
        ⠀⠈⢷⡄⢀⡼⠃⠀⠸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠇⠀⠘⢧⠀⣠⠞⠁⠀
        ⠀⠀⠀⠙⢿⡅⠀⠀⠀⢻⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡟⠀⠀⠀⢸⡿⠉⠀⠀⠀
        ⠀⠀⠀⠀⠈⡧⠀⠀⠀⠀⢷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡾⠀⠀⠀⠀⢼⠁⠀⠀⠀⠀
        ⠀⠀⠀⠀⣸⠇⠀⠀⠀⠀⠈⢷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡞⠁⠀⠀⠀⠀⠸⣇⠀⠀⠀⠀
        ⠀⣤⠦⠟⠁⠀⠀⠀⠀⠀⠀⠀⢹⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⠏⠀⠀⠀⠀⠀⠀⠀⠈⠳⢦⣤⠀
        ⠀⠈⠻⣄⠀⠀⠀⠀⠀⠉⠳⠲⢾⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⡷⠖⠟⠁⠀⠀⠀⠀⠀⣠⠟⠀⠀
        ⠀⠀⠀⠙⣦⠀⠀⠀⠀⠀⠀⠀⠘⢷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡼⠁⠀⠀⠀⠀⠀⠀⠀⣼⠋⠀⠀⠀
        ⠀⠀⠀⠀⠈⢷⡀⠀⠀⠀⠀⠀⠀⠈⢳⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡞⠁⠀⠀⠀⠀⠀⠀⢀⡾⠁⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠻⣆⡀⠀⠀⠀⠀⠀⣀⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⡀⠀⠀⠀⠀⠀⢀⣴⠛⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⢀⣻⠄⠀⢰⡾⠚⠉⠀⠀⠀⠀⠀⠀⣀⣀⢀⡀⠀⠀⠀⠀⢀⣀⣄⠀⠀⠀⠙⠓⢶⡆⠀⢐⣯⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠐⢷⣋⠉⠙⢳⡟⠃⠀⠀⠀⠀⠀⣀⣰⠞⠉⠈⠁⠉⠛⣦⣤⠞⢋⣁⠈⢷⡀⠀⠀⠀⠈⠙⣾⠋⠉⣙⡷⠂⠀⠀⠀⠀⠀
        ⠲⢶⠴⣤⣤⣠⣀⣍⣛⣶⢼⡇⠀⠀⠀⢀⡴⠞⢩⡏⠀⠀⠀⠀⠀⠀⠘⣏⠛⠿⣭⣧⠸⣇⠀⠀⠀⠀⢀⡷⣾⣫⣉⣠⣠⣤⡤⡴⡶⠒
        ⠀⠠⣇⠀⠀⠀⢽⠈⠀⠀⠸⡅⠀⠀⠀⠹⢦⣀⣼⡇⠀⠀⠀⠀⠀⠀⠠⣗⣄⡴⢞⣹⠄⣹⠄⠀⠀⠀⢐⡇⠀⠀⢁⡯⠀⠀⠀⢴⠀⠀
        ⠀⠀⣿⠖⠶⣄⢸⡅⠀⠀⠨⡇⠀⠀⠀⠀⠀⠁⠈⣧⠀⣀⠀⠀⠀⠀⢨⣷⡟⣋⣋⣁⡴⠏⠀⠀⠀⠀⢸⡇⠀⠀⢰⡇⢰⠖⠶⣿⠀⠀
        ⠀⠀⢽⠀⠀⢿⣸⡃⠀⠀⢈⡿⠒⠂⠀⠀⠀⠀⠀⣸⠟⠙⠓⠶⠾⡖⢻⣿⣿⠉⠀⠁⠁⠀⠀⠀⠐⠚⢾⡃⠀⠀⢸⡇⡿⠀⢀⡗⠀⠀
        ⠀⠀⢺⠅⠀⠈⠙⢙⡦⠀⠘⠃⠀⠀⠀⠀⠀⠀⣰⠏⠀⠀⠀⠀⠀⠀⠀⠹⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⢘⣧⣄⢴⡋⠋⠁⠀⢐⡇⠀⠀
        ⠀⠀⢸⡇⠀⠀⠀⣸⠃⠀⠀⠀⠀⠀⠀⠀⠀⢰⣾⣷⡶⠶⠆⠛⠙⠛⠛⢻⡁⠀⠀⠀⠀⠀⢀⡴⠛⠚⠞⠥⣾⣝⣦⠀⠀⠀⢸⠇⠀⠀
        ⠀⠀⠈⡧⠀⠀⠀⠋⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⡿⣿⠅⠀⠀⠀⠀⠀⠀⠘⣇⠀⠀⠀⠀⠀⣾⠁⠀⠀⠀⠀⠀⠈⢹⡆⠀⠀⣼⠁⠀⠀
        ⠀⠀⠀⣻⠀⣼⠛⠆⠀⠀⠀⠀⠀⠀⢠⣾⡿⠃⢀⡟⠀⠀⠀⠀⠀⠀⠀⠀⢹⡄⠀⠀⠀⠀⠈⢧⣀⣠⣀⣀⣀⡀⣸⠟⣧⠀⡯⠀⠀⠀
        ⠀⠀⠀⠸⠅⠗⠀⠀⠀⠀⠀⠀⠀⠐⠿⠋⠀⠀⣼⠃⠀⠀⢀⣠⠴⣤⡀⠀⠀⠹⢦⡀⠀⠀⠀⠀⠉⠈⣽⣹⠉⠉⠉⠀⠺⠨⠇⠀⠀⠀
        ⠀⠀⠀⢰⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣇⣀⣠⣰⠞⠁⠀⠀⠀⢹⣶⣾⣿⠁⠀⠀⠀⠀⠀⠀⠈⠋⠀⠀⠀⠀⠀⢸⡆⠀⠀⠀
        ⠀⠀⣠⡞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⣿⣯⠀⠀⠀⠀⢠⣾⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢷⣄⠀⠀
  `),
  );
  console.log(
    chalk.magentaBright(`| 날짜 : ${day} `) +
      chalk.magentaBright(`| 시간 : ${dayStack} : ${dayName}`) +
      chalk.magentaBright(`| 플레이어 소지금 : ${playerGold} : G `),
    chalk.magentaBright(`| 남은 체력 : ${player.hp} : HP `),
  );
  console.log(
    chalk.magentaBright(
      `=============================================================\n`,
    ),
  );
}
export function displayAdventure(
  player,
  stageName,
  stageStack,
  playerAdventureSprit_AM,
  playerAdventureSprit_PM,
  dayName,
  dayStack,
  day,
  stageCount,
) {
  console.log(
    chalk.magentaBright(
      `\n===================== ${stageName[stageStack]} ====================`,
    ),
  );
  console.log(
    dayStack != 3
      ? chalk.cyanBright(playerAdventureSprit_AM[stageStack])
      : chalk.cyanBright(playerAdventureSprit_PM[stageStack]),
  );
  console.log(
    chalk.cyanBright(
      `| 날짜 : ${day} ${dayName[dayStack]}   : Stage : ${stageName[stageStack]} `,
    ) +
      chalk.blueBright(
        `| 플레이어 정보 : ${player._level} | 남은 경험치 | ${
          player._levelUpExp - player._exp
        } | 남은 체력 :  ${player.hp} | `,
      ),
  );
  let str_temp = '';
  for (let i = 0; i < stageCount; i++) {
    str_temp += '=';
  }
  console.log(chalk.whiteBright(`현재 스테이지 진행도 : ${str_temp}>`));
  console.log(
    chalk.magentaBright(
      `=============================================================\n`,
    ),
  );
}
export function displayAdventure_Failed(
  check,
  stageName,
  playerAdventureSprit_defoltEvent,
) {
  console.log(
    chalk.magentaBright(
      `\n======================= ${stageName} ======================`,
    ),
  );
  console.log(chalk.cyanBright(playerAdventureSprit_defoltEvent[0]));
  console.log(
    chalk.cyanBright(
      check
        ? `| 아무것도 얻지 못하였습니다. ㅠ^ㅠ 하지만 제대로 길은 맞는 방향입니다. |`
        : `| 아무것도 얻지 못하였습니다. ㅠ^ㅠ 그리고 길도 잃어버렸습니다. |`,
    ),
  );
  console.log(
    chalk.magentaBright(
      `=============================================================\n`,
    ),
  );
}
export function displayAdventure_Battle(
  player,
  monster,
  str,
  index,
  playerTrun,
  stageName,
  monster_Name,
) {
  console.log(
    chalk.magentaBright(
      `\n======================= ${stageName} ======================`,
    ),
  );
  playerTrun
    ? console.log(chalk.cyanBright(player._dotSprit[index]))
    : console.log(chalk.cyanBright(monster._dotSprit[index]));
  console.log(chalk.cyanBright(str));
  console.log(
    chalk.magentaBright(
      `=============================================================\n`,
    ),
  );
}
export function displayAdventure_Shop(
  check,
  stageName,
  playerAdventureSprit_SpecialEvent,
  playerGold,
) {
  console.log(
    chalk.magentaBright(
      `\n======================= ${stageName} 상점★ ======================`,
    ),
  );
  console.log(chalk.cyanBright(playerAdventureSprit_SpecialEvent[0]));
  check
    ? console.log(
        chalk.cyanBright(`| 안녕하세요..★ 저희 물건좀 보고가세요..★ | `),
      )
    : console.log(
        chalk.whiteBright(` 0^0 `) +
          chalk.redBright(`| 1 : 붉은색 알약 | 1200 G | `) +
          chalk.yellowBright(`| 2 : 노란색 알약 | 1200 G | `) +
          chalk.greenBright(`| 3 : 초록색 알약 | 1200 G | `) +
          chalk.green(`| 4 : 물약 체력을 20 회복시켜 드립니다. | 1000 G |`),
        chalk.blueBright(`| 현재 보유 골드 : ${playerGold} G |`),
      );
  console.log(
    chalk.magentaBright(
      `=============================================================\n`,
    ),
  );
}
export function displayAdventure_Trap(
  str,
  index,
  player,
  stageName,
  playerAdventureSprit_SpecialEvent,
) {
  console.log(
    chalk.magentaBright(
      `\n======================= ${stageName} ======================`,
    ),
  );
  console.log(chalk.cyanBright(playerAdventureSprit_SpecialEvent[index]));
  console.log(
    chalk.cyanBright(str) + chalk.cyanBright(`현재 체력 : ${player.hp}`),
  );
  console.log(
    chalk.magentaBright(
      `=============================================================\n`,
    ),
  );
}

export function displayAdventure_Succes(
  check,
  index,
  stageName,
  playerAdventureSprit_defoltEvent,
  itemData,
) {
  console.log(
    chalk.magentaBright(
      `\n======================= ${stageName} ======================`,
    ),
  );
  console.log(chalk.cyanBright(playerAdventureSprit_defoltEvent[index]));
  console.log(
    chalk.cyanBright(
      check
        ? `| ${itemData[index][1]}을 획득 하셨습니다. 그리고 제대로 길은 맞는 방향입니다. |`
        : `| ${itemData[index][1]}을 획득 하셨습니다. 하지만 길을 잃어버렸습니다. |`,
    ),
  );
  console.log(
    chalk.magentaBright(
      `=============================================================\n`,
    ),
  );
}
export function displayinventory(itemData, playerInventory) {
  console.log(
    chalk.magentaBright(
      `\n=========================== 인벤토리 ==========================`,
    ),
  );
  console.log(
    chalk.magentaBright(
      `
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⡷⢦⡀⠀⠀⠀⠀⣰⢶⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡟⠀⠙⢦⡀⠀⣰⠏⠈⢷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠇⠀⠀⠈⢳⣤⡏⠀⡀⠘⣇⠀⠀⣀⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⠋⠀⠀⠀⠀⠀⡿⠀⢸⡇⠀⢻⣠⡞⠉⢸⣇⣀⣄⣀⣤⣴⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⠃⠀⠀⠀⠀⠀⢸⡇⠀⢺⡅⠀⠸⠋⠀⠀⠀⠉⠀⠀⠀⠀⠉⠓⢶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⡇⠀⠀⠀⠀⠀⠀⠸⡇⠀⠸⡇⡀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡆⠀⠀⠀⠀⠀⠀⠈⣧⠀⠀⣻⠃⠀⠁⣀⠀⠀⠀⠀⠀⢸⣶⠆⠀⠀⠀⢸⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⡇⠀⠀⠀⠀⠀⠀⠀⣹⠀⢠⡏⠀⠀⠀⢽⠷⣄⡀⠀⠀⠈⣸⣶⠓⢦⡀⢐⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣆⠀⠀⠀⠀⠀⢰⡏⠀⣺⠁⠀⠀⢀⡟⠀⠨⡝⠳⠶⢶⣿⣿⣇⢼⡃⠠⣇⡀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠳⣆⣀⢠⡞⢻⠂⢀⡏⠀⠀⠰⢾⠗⠛⠛⠂⠀⠀⢸⣿⣿⢫⣿⣆⣸⠏⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⡟⠀⢹⡄⢸⠇⠀⠀⢠⡟⠀⢀⣀⣀⣀⡀⠀⠉⠋⠺⢛⣈⡙⠳⠦⠙⣧⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⠿⠓⠓⠻⠳⣼⣇⠀⣠⠟⠀⣴⢿⣩⡏⠉⠉⣶⣶⢦⡀⠀⠈⢹⣧⣴⣞⣅⣀⠀⠀⠀⠀⠀⠀⠀⠀
  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⣿⠟⠁⠀⠀⠀⠀⠀⠘⣿⣿⣿⣾⣶⣧⠀⢉⣤⣦⣦⡈⠁⢸⣇⣴⣶⣾⣅⠀⠀⠉⠈⢷⡀⠀⠀⠀⠀⠀⠀
  `,
    ),
  );
  for (let key in playerInventory) {
    console.log(
      chalk.cyanBright(
        `| ${key} 번째 칸 : ${itemData[playerInventory[key][0]][1]} `,
      ) +
        chalk.blueBright(
          `| 아이템 정보 : ${itemData[playerInventory[key][0]][2]} `,
        ) +
        chalk.yellowBright(
          `| 가격 정보 : ${itemData[playerInventory[key][0]][0]} `,
        ) +
        chalk.yellowBright(`| 중첩 갯수 : ${playerInventory[key][1]} |`),
    );
  }
  console.log(
    chalk.magentaBright(
      `=============================================================\n`,
    ),
  );
}
export function displayStatus(player) {
  console.log(
    chalk.magentaBright(
      `\n===================== 플레이어 정보창 ====================`,
    ),
  );
  console.log(
    chalk.cyanBright(`
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡤⠶⠲⠒⢓⡓⠛⡓⠓⡓⠲⠶⢦⡀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠇⠀⠀⢾⡷⢾⡷⠘⠗⠐⠟⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⠀⠀⠸⡇⠀⠀⠈⠁⣠⣀⢀⡄⣠⡄⣀⠀⣸⠃⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣀⠀⠀⠀⠀⢀⣀⠀⠀⠀⢀⡞⠹⡇⠀⠈⣧⠀⠀⣶⡆⠺⣿⣿⣿⣿⢃⣿⠁⣾⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡇⣏⠳⢦⡀⣠⠞⣻⡤⢶⣄⡟⢰⡆⢻⡀⠀⢻⠀⠀⢿⣷⣷⣿⣿⣿⣿⣿⠿⢸⡃⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣇⢻⡀⠈⠳⠋⠀⢀⡀⠈⠉⠛⢾⡅⢸⡇⠀⢸⡇⠀⠀⠈⠉⢿⣿⣿⡇⠀⠀⣾⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⡈⠹⢶⣄⠀⣀⡸⢿⡒⣆⣄⡀⢹⡾⠀⠀⠀⠛⠛⡓⠶⠺⠛⠛⠛⠋⠋⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢷⠆⡾⢙⡿⢩⣿⡾⢷⣿⣬⣻⢬⡇⠀⠀⠀⠀⣿⣿⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢼⡰⡏⠸⡇⢺⣿⡿⠘⣿⣿⣹⣿⡧⠀⠀⠀⣀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣇⡧⠀⣹⠏⠉⠰⠻⠂⢉⣨⣽⡇⠀⠀⢸⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣿⡄⣸⠗⠶⠤⠴⠞⠋⠁⣹⠇⠀⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢾⣳⣾⡀⠀⣀⣠⣤⣤⡴⠟⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢨⡟⣿⣾⣿⡟⢉⣈⢉⡾⠳⣝⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡿⠞⠉⠀⠀⢹⣿⣿⣼⠇⠀⠈⠉⠻⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡶⠋⠀⠀⠀⠀⠀⢨⣿⣷⣾⠇⠀⠀⠀⠀⣼⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣇⠀⠀⠀⠀⠀⠀⢼⠛⠿⢻⡇⠀⠀⢀⣤⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢘⣷⣶⠶⠤⠴⠤⠟⠀⠀⠀⠹⣤⢶⡋⠀⠙⢷⣀⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣷⡞⠁⠀⠀⠀⠛⠛⠚⠶⠶⠖⠟⠂⠀⠁⠀⠀⢸⠏⣸⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⡶⠶⣟⠸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⠃⠉⠉⣹⠆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⠄⠁⠀⠙⠷⣤⡀⢠⣠⣤⡤⢤⠤⠶⠖⠶⠲⠖⠀⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀      
  `),
  );
  console.log(
    chalk.cyanBright(` | 현재 플레이어 레벨: ${player._level} `) +
      chalk.blueBright(`| 남은 스텟 포인트 : ${player._playerSkillPoint} `) +
      chalk.redBright(`| 스텟 정보 |`),
  );
  console.log(
    chalk.cyanBright(` | 0-0 `) +
      chalk.blueBright(`| Luck : ${player._luck}`) +
      chalk.redBright(
        ` | 기본적인 이벤트 나올 확률 더 좋은 상자가 나올 확률을 늘려줍니다. |`,
      ),
  );
  console.log(
    chalk.cyanBright(`| 0^0 `) +
      chalk.blueBright(`| STR : ${player._str}`) +
      chalk.redBright(
        `| 특정 이벤트에 필요하고 체력과 공격력 성장 계수에 영향을 끼칩니다. |`,
      ),
  );
  console.log(
    chalk.cyanBright(`| 0.0 `) +
      chalk.blueBright(`| DEX : ${player._dex}`) +
      chalk.redBright(
        `| 안 좋은 이벤트시 받는 데미지를 줄여주거나 괴물 회피 확률 또는 도주 확률을 늘려줍니다. |`,
      ),
  );
  console.log(
    chalk.magentaBright(
      `=============================================================\n`,
    ),
  );
}
export function displayCamp(player, dayStack) {
  console.log(
    chalk.magentaBright(
      `\n======================== 캠핑 =======================`,
    ),
  );
  console.log(
    chalk.cyanBright(`
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⣠⣠⣠⣠⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡴⠖⠛⠉⠁⠉⠈⠀⠀⠀⠀⠈⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⠀⠀⠀⠀⢀⣀⡶⢶⡟⢻⡄⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡆⠀⡶⠛⠛⠋⣿⠹⡇⢸⠂⠀⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣇⠀⠙⠓⠛⠛⢛⣉⡉⢁⣀⣰⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠶⠶⠂⠛⢋⣉⡉⠁⠈⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⡀⠀⠀⠀⢀⣾⣧⣄⣄⢀⣀⣀⣄⣤⢤⡄⠀⣿⣿⡷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⡏⣨⡉⠛⠳⠶⡟⠀⢀⡀⠈⠛⠛⢧⡴⢂⡼⠁⢀⣀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢳⣄⠙⠶⢶⣦⠀⠀⠀⠹⣆⡀⠀⠀⢻⡞⠁⠀⢺⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⢷⠂⣾⠉⢷⠴⠤⣤⡟⣿⣶⣆⡸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢺⡀⡗⠀⣸⠷⠲⠆⠀⣿⣯⣸⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣧⡇⠀⢼⠁⠀⠰⠛⠆⢀⣠⡽⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣷⢠⡟⠲⠶⠶⠲⠛⠉⠁⣻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⣏⣀⣀⣴⢦⣠⣴⢶⣶⣏⣀⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣽⣿⣿⡿⣿⠀⠉⠓⠶⣄⣽⣿⣿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⡄⣰⠏⠀⠀⢶⣦⡈⠻⣿⣿⡍⡧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⠀⠀⣿⢹⣿⣿⡿⠁⠀⢰⢶⡼⠀⠙⣦⠈⠹⣾⠃⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢾⣹⠇⠀⣿⠸⣿⣿⠁⠀⣰⠏⠀⠀⠀⠀⢘⡇⠀⠸⣧⣀⣄⣠⣴⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣹⣧⡤⣽⡿⣾⡇⠀⠸⡇⠀⠀⠀⠀⠀⢸⠇⠀⢨⡿⡇⠀⠈⢹⡂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡃⠀⠀⢸⡇⠈⣧⠀⢠⡿⡶⢶⣶⡶⢛⣻⣷⠆⣼⠁⢿⠀⠀⢹⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡆⠀⠀⣾⠁⠀⠹⣆⣸⡿⠋⡉⠋⠛⡛⣻⢿⣾⡃⠀⢸⣁⠀⣺⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⢀⡾⣿⣂⢀⣀⣸⣿⣿⣿⣿⣿⣿⢿⠿⡿⠟⠹⠒⠛⠙⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠉⠉⠉⠁⠁⠁⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
  `),
  );
  console.log(
    chalk.cyanBright(` | 캠핑 시 오전으로 초기화 체력 남은 스택 비례 회복 `) +
      chalk.blueBright(`| 다음날까지 남은 스택 : ${3 - dayStack + 1} `) +
      chalk.redBright(
        `| 예상 회복량 :  ${player._hp * (3 - dayStack + 1) * 0.2} |`,
      ),
  );
  console.log(
    chalk.magentaBright(
      `=============================================================\n`,
    ),
  );
}
